#language: ru

@tree

Функционал: Настройка кадрового учета и штатного расписания

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект> 

Сценарий: Настройка кадрового учета и штатного расписания
И В командном интерфейсе я выбираю 'Настройка' 'Кадровый учет'
Тогда открылось окно 'Кадровый учет'
И я нажимаю на кнопку с именем 'НастройкаШтатногоРасписания'
Тогда открылось окно 'Настройка штатного расписания'
И я изменяю флаг с именем 'ПроверятьНаСоответствиеШтатномуРасписаниюАвтоматически'
И я изменяю флаг с именем 'ПроверятьНаСоответствиеШтатномуРасписаниюАвтоматически'
И я изменяю флаг с именем 'ИспользоватьИсториюИзмененияШтатногоРасписания'
И я изменяю флаг с именем 'ИспользоватьИсториюИзмененияШтатногоРасписания'
И я изменяю флаг с именем 'ИспользоватьПриОписанииПозицииШтатногоРасписанияРазрядыКатегорииКлассыДолжностейИПрофессий'
И я изменяю флаг с именем 'ИспользоватьПриОписанииПозицииШтатногоРасписанияРазрядыКатегорииКлассыДолжностейИПрофессий'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияРаздельныйУчетПозицийШтатногоРасписанияПоРазрядам'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияРаздельныйУчетПозицийШтатногоРасписанияПоРазрядам'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияПоказыватьТолькоВакантные'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияПоказыватьТолькоВакантные'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияВедениеШтатногоСУчетомСистемыОплатыТруда'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияВедениеШтатногоСУчетомСистемыОплатыТруда'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияФОТБезУчетаНадбавок'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияФОТБезУчетаНадбавок'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияРассчитыватьЧТС1Разряда'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияРассчитыватьЧТС1Разряда'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияРасчетФОТсУчетомНормыВремени'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияРасчетФОТсУчетомНормыВремени'
И я перехожу к закладке с именем "СтраницаДополнительныеПоказатели"
И я изменяю флаг с именем 'УчетРазделовШтатногоРасписания'
И я изменяю флаг с именем 'УчетРазделовШтатногоРасписания'
И я изменяю флаг с именем 'ИспользоватьРазличныеВидыУчетаПозицийШтатногоРасписания'
И я изменяю флаг с именем 'ИспользоватьРазличныеВидыУчетаПозицийШтатногоРасписания'
И я изменяю флаг с именем 'УчетНазначенияПозицийШтатногоРасписания'
И я изменяю флаг с именем 'УчетНазначенияПозицийШтатногоРасписания'
И я перехожу к закладке с именем "СтраницаФормулыРасчета"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
Тогда открылось окно 'Кадровый учет'
И я изменяю флаг с именем 'ИспользоватьРаботуНаНеполнуюСтавку'
И я изменяю флаг с именем 'ИспользоватьРаботуНаНеполнуюСтавку'
И я изменяю флаг с именем 'ИспользоватьВоинскийУчет'
И я изменяю флаг с именем 'ИспользоватьВоинскийУчет'
И я изменяю флаг с именем 'ИспользоватьБронированиеГраждан'
И я изменяю флаг с именем 'ИспользоватьБронированиеГраждан'
И я изменяю флаг с именем 'ИспользуетсяТрудЛетноПодъемногоСостава'
И я изменяю флаг с именем 'ИспользуетсяТрудЛетноПодъемногоСостава'
И я изменяю флаг с именем 'ИспользуетсяТрудПлавсостава'
И я изменяю флаг с именем 'ИспользуетсяТрудПлавсостава'
И я перехожу к закладке с именем "ГруппаДополнительно"
И я изменяю флаг с именем 'УчитыватьВидыСтруктурныхПодразделений'
И я изменяю флаг с именем 'УчитыватьВидыСтруктурныхПодразделений'
И я изменяю флаг с именем 'НастройкиКадровогоУчетаВыводитьГоловноеПодразделение'
И я изменяю флаг с именем 'НастройкиКадровогоУчетаВыводитьГоловноеПодразделение'
И я изменяю флаг с именем 'УчитыватьВнештатныхСотрудников'
И я изменяю флаг с именем 'УчитыватьВнештатныхСотрудников'
И я изменяю флаг с именем 'ВводитьПредыдущиеМестаРаботыВСправочник'
И я изменяю флаг с именем 'ВводитьПредыдущиеМестаРаботыВСправочник'
И я изменяю флаг с именем 'ДополнитьТрудовуюДеятельностьКадровымиДанными'
И я изменяю флаг с именем 'ДополнитьТрудовуюДеятельностьКадровымиДанными'
И я изменяю флаг с именем 'УчетРабочихМестСотрудников'
И я изменяю флаг с именем 'УчетРабочихМестСотрудников'
И я изменяю флаг с именем 'ЗапретитьРедактированиеНСИ'
И я изменяю флаг с именем 'ЗапретитьРедактированиеНСИ'
И Я закрываю окно 'Кадровый учет'
