#language: ru

@tree

Функционал: Настройка учета разделов штатного расписания

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект> 

Сценарий: Настройка учета разделов штатного расписания
И В командном интерфейсе я выбираю 'Настройка' 'Кадровый учет'
Тогда открылось окно 'Кадровый учет'
И я нажимаю на кнопку с именем 'НастройкаШтатногоРасписания'
Тогда открылось окно 'Настройка штатного расписания'
И я изменяю флаг с именем 'НастройкиШтатногоРасписанияРаздельныйУчетПозицийШтатногоРасписанияПоРазрядам'
И я перехожу к закладке с именем "СтраницаДополнительныеПоказатели"
И я изменяю флаг с именем 'УчетРазделовШтатногоРасписания'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
Тогда открылось окно 'Кадровый учет'
И Я закрываю окно 'Кадровый учет'
