#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект> 

Сценарий: <описание сценария>
И В командном интерфейсе я выбираю 'Настройка' 'Категории работников'
Тогда открылось окно 'Категории работников'
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно 'Категории работников (создание)'
И в поле с именем 'Наименование' я ввожу текст 'Руководители'
И из выпадающего списка с именем "КатегорияСУ" я выбираю точное значение 'Руководители'
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно 'Руководители (Категории работников)'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Руководители (Категории работников)' в течение 20 секунд
Тогда открылось окно 'Категории работников'
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно 'Категории работников (создание)'
И в поле с именем 'Наименование' я ввожу текст 'Специалисты'
И из выпадающего списка с именем "КатегорияСУ" я выбираю точное значение 'Специалисты'
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно 'Специалисты (Категории работников)'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Специалисты (Категории работников)' в течение 20 секунд
Тогда открылось окно 'Категории работников'
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно 'Категории работников (создание)'
И в поле с именем 'Наименование' я ввожу текст 'Служащие'
И из выпадающего списка с именем "КатегорияСУ" я выбираю точное значение 'Другие служащие'
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно 'Служащие (Категории работников)'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Служащие (Категории работников)' в течение 20 секунд
Тогда открылось окно 'Категории работников'
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно 'Категории работников (создание)'
И в поле с именем 'Наименование' я ввожу текст 'Рабочие'
И из выпадающего списка с именем "КатегорияСУ" я выбираю точное значение 'Рабочие'
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно 'Рабочие (Категории работников)'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Рабочие (Категории работников)' в течение 20 секунд
Тогда открылось окно 'Категории работников'
И Я закрываю окно 'Категории работников'
